In [17]:
import pandas as pd
import datasist as ds
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sn
import datetime as dt

In [18]:
cab_data = pd.read_csv('https://raw.githubusercontent.com/DataGlacier/DataSets/main/Cab_Data.csv')
cab_data.head(3)

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,42377,Pink Cab,ATLANTA GA,30.45,370.95,313.635
1,10000012,42375,Pink Cab,ATLANTA GA,28.62,358.52,334.854
2,10000013,42371,Pink Cab,ATLANTA GA,9.04,125.20,97.632

In [19]:
#change date of travel to datetime type
cab_data['Date of Travel']=pd.to_datetime(cab_data['Date of Travel'],unit='D',origin='1899-12-30')

In [20]:
ds.structdata.describe(cab_data)

First five data points

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,2016-01-08,Pink Cab,ATLANTA GA,30.45,370.95,313.635
1,10000012,2016-01-06,Pink Cab,ATLANTA GA,28.62,358.52,334.854
2,10000013,2016-01-02,Pink Cab,ATLANTA GA,9.04,125.20,97.632
3,10000014,2016-01-07,Pink Cab,ATLANTA GA,33.17,377.40,351.602
4,10000015,2016-01-03,Pink Cab,ATLANTA GA,8.73,114.62,97.776

Random five data points

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
333985,10409340,2018-11-14,Yellow Cab,CHICAGO IL,31.20,432.88,378.1440
149035,10183748,2017-06-08,Yellow Cab,WASHINGTON DC,8.72,123.91,104.6400
76974,10095360,2016-10-27,Pink Cab,NASHVILLE TN,28.34,293.88,291.9020
32844,10041578,2016-06-08,Yellow Cab,LOS ANGELES CA,43.70,1037.78,618.7920
275185,10338017,2018-06-08,Yellow Cab,WASHINGTON DC,6.12,128.15,80.0496

Last five data points

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
359387,10440101,2018-01-08,Yellow Cab,WASHINGTON DC,4.80,69.24,63.3600
359388,10440104,2018-01-04,Yellow Cab,WASHINGTON DC,8.40,113.75,106.8480
359389,10440105,2018-01-05,Yellow Cab,WASHINGTON DC,27.75,437.07,349.6500
359390,10440106,2018-01-05,Yellow Cab,WASHINGTON DC,8.80,146.19,114.0480
359391,10440107,2018-01-02,Yellow Cab,WASHINGTON DC,12.76,191.58,177.6192

Shape of  data set: (359392, 7)


Size of  data set: 2515744


Data Types
Note: All Non-numerical features are identified as objects in pandas

                     Data Type
Transaction ID           int64
Date of Travel  datetime64[ns]
Company                 object
City                    object
KM Travelled           float64
Price Charged          float64
Cost of Trip           float64

Column(s) {'Date of Travel'} should be in Datetime format. Use the [to_date] function in datasist.feature_engineering to convert to Pandas Datetime format


Numerical Features in Data set
['Transaction ID', 'KM Travelled', 'Price Charged', 'Cost of Trip']


Categorical Features in Data set

['Company', 'City']

Statistical Description of Columns

       Transaction ID   KM Travelled  Price Charged   Cost of Trip
count    3.593920e+05  359392.000000  359392.000000  359392.000000
mean     1.022076e+07      22.567254     423.443311     286.190113
std      1.268058e+05      12.233526     274.378911     157.993661
min      1.000001e+07       1.900000      15.600000      19.000000
25%      1.011081e+07      12.000000     206.437500     151.200000
50%      1.022104e+07      22.440000     386.360000     282.480000
75%      1.033094e+07      32.960000     583.660000     413.683200
max      1.044011e+07      48.000000    2048.030000     691.200000

Description of Categorical Features

          count unique          top    freq
Company  359392      2   Yellow Cab  274681
City     359392     19  NEW YORK NY   99885

Unique class Count of Categorical features

Missing Values in Data

         features  missing_counts  missing_percent
0  Transaction ID               0              0.0
1  Date of Travel               0              0.0
2         Company               0              0.0
3            City               0              0.0
4    KM Travelled               0              0.0
5   Price Charged               0              0.0
6    Cost of Trip               0              0.0

In [21]:
city=pd.read_csv('https://raw.githubusercontent.com/DataGlacier/DataSets/main/City.csv')
ds.structdata.describe(city)

First five data points

             City   Population      Users
0     NEW YORK NY   8,405,837    302,149
1      CHICAGO IL   1,955,130    164,468
2  LOS ANGELES CA   1,595,037    144,132
3        MIAMI FL   1,339,155     17,675
4  SILICON VALLEY   1,177,609     27,247

Random five data points

            City Population     Users
8      DALLAS TX   942,908    22,157
6   SAN DIEGO CA   959,307    69,995
11     AUSTIN TX   698,371    14,978
9     ATLANTA GA   814,885    24,701
12    SEATTLE WA   671,238    25,063

Last five data points

             City Population      Users
15  SACRAMENTO CA   545,776      7,044
16  PITTSBURGH PA   542,085      3,643
17  WASHINGTON DC   418,859    127,001
18   NASHVILLE TN   327,225      9,270
19      BOSTON MA   248,968     80,021

Shape of  data set: (20, 3)


Size of  data set: 60


Data Types
Note: All Non-numerical features are identified as objects in pandas

           Data Type
City          object
Population    object
Users         object

Numerical Features in Data set
[]


Categorical Features in Data set

['City', 'Population', 'Users']

Statistical Description of Columns

               City   Population      Users
count            20           20         20
unique           20           20         20
top     NEW YORK NY   8,405,837    302,149
freq              1            1          1

Description of Categorical Features

           count unique          top freq
City          20     20  NEW YORK NY    1
Population    20     20   8,405,837     1
Users         20     20     302,149     1

Unique class Count of Categorical features

Missing Values in Data

     features  missing_counts  missing_percent
0        City               0              0.0
1  Population               0              0.0
2       Users               0              0.0

In [22]:
customer_ID = pd.read_csv('https://raw.githubusercontent.com/DataGlacier/DataSets/main/Customer_ID.csv')
ds.structdata.describe(customer_ID)

First five data points

   Customer ID Gender  Age  Income (USD/Month)
0        29290   Male   28               10813
1        27703   Male   27                9237
2        28712   Male   53               11242
3        28020   Male   23               23327
4        27182   Male   33                8536

Random five data points

       Customer ID  Gender  Age  Income (USD/Month)
34660        14506  Female   23               13753
33943        29299  Female   37                5206
15224        53644    Male   30               21970
1283         51377    Male   42               32209
16919        58421  Female   21                7509

Last five data points

       Customer ID  Gender  Age  Income (USD/Month)
49166        12490    Male   33               18713
49167        14971    Male   30               15346
49168        41414    Male   38                3960
49169        41677    Male   23               19454
49170        39761  Female   32               10128

Shape of  data set: (49171, 4)


Size of  data set: 196684


Data Types
Note: All Non-numerical features are identified as objects in pandas

                   Data Type
Customer ID            int64
Gender                object
Age                    int64
Income (USD/Month)     int64

Numerical Features in Data set
['Customer ID', 'Age', 'Income (USD/Month)']


Categorical Features in Data set

['Gender']

Statistical Description of Columns

        Customer ID           Age  Income (USD/Month)
count  49171.000000  49171.000000        49171.000000
mean   28398.252283     35.363121        15015.631856
std    17714.137333     12.599066         8002.208253
min        1.000000     18.000000         2000.000000
25%    12654.500000     25.000000         8289.500000
50%    27631.000000     33.000000        14656.000000
75%    43284.500000     42.000000        21035.000000
max    60000.000000     65.000000        35000.000000

Description of Categorical Features

        count unique   top   freq
Gender  49171      2  Male  26562

Unique class Count of Categorical features

Missing Values in Data

             features  missing_counts  missing_percent
0         Customer ID               0              0.0
1              Gender               0              0.0
2                 Age               0              0.0
3  Income (USD/Month)               0              0.0

In [23]:
transaction_ID = pd.read_csv('https://raw.githubusercontent.com/DataGlacier/DataSets/main/Transaction_ID.csv')
ds.structdata.describe(transaction_ID)

First five data points

   Transaction ID  Customer ID Payment_Mode
0        10000011        29290         Card
1        10000012        27703         Card
2        10000013        28712         Cash
3        10000014        28020         Cash
4        10000015        27182         Card

Random five data points

        Transaction ID  Customer ID Payment_Mode
175815        10175826        20819         Cash
407354        10407365        51357         Card
41974         10041985         1648         Card
419791        10419802         4565         Card
150146        10150157         5808         Card

Last five data points

        Transaction ID  Customer ID Payment_Mode
440093        10440104        53286         Cash
440094        10440105        52265         Cash
440095        10440106        52175         Card
440096        10440107        52917         Card
440097        10440108        51587         Card

Shape of  data set: (440098, 3)


Size of  data set: 1320294


Data Types
Note: All Non-numerical features are identified as objects in pandas

               Data Type
Transaction ID     int64
Customer ID        int64
Payment_Mode      object

Numerical Features in Data set
['Transaction ID', 'Customer ID']


Categorical Features in Data set

['Payment_Mode']

Statistical Description of Columns

       Transaction ID    Customer ID
count    4.400980e+05  440098.000000
mean     1.022006e+07   23619.513120
std      1.270455e+05   21195.549816
min      1.000001e+07       1.000000
25%      1.011004e+07    3530.000000
50%      1.022006e+07   15168.000000
75%      1.033008e+07   43884.000000
max      1.044011e+07   60000.000000

Description of Categorical Features

               count unique   top    freq
Payment_Mode  440098      2  Card  263991

Unique class Count of Categorical features

Missing Values in Data

         features  missing_counts  missing_percent
0  Transaction ID               0              0.0
1     Customer ID               0              0.0
2    Payment_Mode               0              0.0